# back
# устанавливаем самую лёгкую версию JVM
FROM openjdk:20

# указываем ярлык. Например, разработчика образа и проч. Необязательный пункт.
LABEL maintainer="milya1265@mail.ru"

# указываем точку монтирования для внешних данных внутри контейнера (как мы помним, это Линукс)
VOLUME /tmp

# внешний порт, по которому наше приложение будет доступно извне
EXPOSE 8099

# указываем, где в нашем приложении лежит джарник
ARG JAR_FILE=out/artifacts/api1_jar2/api1.jar

# добавляем джарник в образ под именем rebounder-chain-backend.jar
ADD ${JAR_FILE} api1.jar

# команда запуска джарника
ENTRYPOINT ["java","-jar","/api1.jar"]


